lisp/mixlang-in-lisp.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-06-03 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Common lisp 与其它语言的集成</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"/><link rel="stylesheet" href="/css/site.css"/>
</head>
<body>
<div id="preamble" class="status">
<nav class="site-nav"><a class="brand" href="/">Jingtao&nbsp;Xu</a><span class="nav-links"><a href="/about/about.html">About</a><a href="/#services">Work</a><a href="/writing.html">Writing</a><a href="/proof.html">Proof</a><a class="nav-cta" href="/contact.html">Connect</a></span></nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Common lisp 与其它语言的集成</h1>
</header><div id="outline-container-org17b9518" class="outline-2">
<h2 id="org17b9518"><a href="http://ecls.sourceforge.net/">ECL</a></h2>
<div class="outline-text-2" id="text-org17b9518">
<p>
ECL使用C/C++来编译lisp程序，可以同c/c++很好的集成在一起，互相调用。
它同<a href="http://www.gnu.org/software/guile/">guile</a> 类似，不同的是guile不支持Common lisp。
</p>
</div>
</div>
<div id="outline-container-org6505c2d" class="outline-2">
<h2 id="org6505c2d"><a href="http://www.cormanlisp.com/">Corman</a></h2>
<div class="outline-text-2" id="text-org6505c2d">
<p>
Corman是为windows量身打造的，开放源代码，其IDE不免费。可以很好的同c/c++集成，
互相调用(in-process COM server),其提供的widnows api接口使用了CLOS，使用自然简洁。
</p>
<div class="org-src-container">
<pre class="src src-lisp"><code>(defmethod handle-message ((window &lt;hello-window&gt;) (message &lt;paint-message&gt;) wparam lparam)
	(declare (ignore wparam lparam))
    (begin-paint window)
	(let ((rect (hello-text-rect window)))
		(GetClientRect (window-hwnd window) rect)
		(DrawText (window-hdc window) 
			(ct:create-c-string "Hello, World") 
			-1 
			rect
			(logior DT_SINGLELINE DT_CENTER DT_VCENTER)))
    (end-paint window)
	0)
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org6a2d30d" class="outline-2">
<h2 id="org6a2d30d"><a href="http://common-lisp.net/project/cffi/">cffi</a></h2>
<div class="outline-text-2" id="text-org6a2d30d">
<p>
 cffi(Common Foreign Function Interface)为各种common lisp方言提供了统一的与c/c++语言通讯的接口。
 可以调用windows api。同时由于<a href="http://www.swig.org/">swig</a>支持cffi，所以可以使用swig来自动生成lisp下的接口代码。
<a href="http://code.google.com/p/lispbuilder/">lispbuilder</a>提供了一个lispbuilder-windows(windows.h wrapper)模块，提供了windows.h的接口代码。
并有一个演示gui的例子。
</p>
</div>
</div>
<div id="outline-container-org544f835" class="outline-2">
<h2 id="org544f835"><a href="http://www.peter-herth.de/ltk/">ltk</a></h2>
<div class="outline-text-2" id="text-org544f835">
<p>
如果使用common lisp进行一些gui编程，可以考虑ltk，它使用tcl/tk做为gui前端，并将
tk的代码转换成common lisp风格。扩展起来也比较容易。
</p>
</div>
</div>
<div id="outline-container-orgb8fd1a0" class="outline-2">
<h2 id="orgb8fd1a0"><a href="http://wiht.link/common-lisp">Common Lisp: Intro, Resources and FAQ</a></h2>
<div class="outline-text-2" id="text-orgb8fd1a0">
<p>
这个网站上集成了各种lisp学习资源．
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="site-footer"><p>Remote · UTC+8 · fluent English / 中文</p><p><a href="mailto:dev@jingtao.net">dev@jingtao.net</a> · <a href="https://cal.com/jingtaoxu">Book a call</a> · <a href="https://github.com/jingtao-net">github.com/jingtao-net</a></p><p class="fineprint">© Jingtao Xu</p></footer>
</div>
</body>
</html>
